package process;

/*


ToDO 0 На входе есть String, который  содержит в себе текст из нескольких предложений.
Например: Нравится ли тебе Java? Очень нравится? Тогда посвящай Java, как можно больше времени, и днем, и ночью, и во сне :)

Необходимо:
ToDO  4 1. Разбить на предложения. Каждое предложение – это класс.
ToDO  5 2. Разбить на слова и пунктуацию. Каждое слово – это класс. Пунктуация – это класс.
ToDO  6 3. Разбить на буквы. Буквы – это класс.

Соответственно:
ToDO 3 Класс Текст состоит из набора экземпляров класса Предложение
ToDO 2 класс Предложение состоит из набора экземпляров класса Слово и класс Пунктуация
ToDO 1 класс Слово состоит из набора экземпляров класса Буква

Далее написать методы:
ToDo 7 1. Подсчитать, сколько всего предложений, слов, букв.
ToDO 8 2. Подсчитать, сколько вопросительных предложений.
ToDO 9 3. Подсчитать, сколько слов начинаются на букву «п».

 */


public class Main {

    public static final String s = "Нравится ли тебе Java? Очень нравится? " +
            "Тогда посвящай Java, как можно больше времени, и днем, и ночью, и во сне :)";

    public static void main(String[] args) {

    }

}
